GHB2/src/InformationRegisters/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_НастройкиВозможностейЗакрепленияПарковочныхМест</name>
  <attributes>
    <name>РедактированиеДокументаЗакрепления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОбУвольненииСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОПрекращенииДействияПропуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ИспользоватьДляЗакрепленияПарковочныхМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РуководителиЛокаций/гхб_РуководителиЛокаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РуководителиЛокаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_НастройкиВозможностейЗакрепленияПарковочныхМест/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		_Массив = Справочники.гхб_Помещения.ВернутьАктивныеПомещенияПоТипу(Справочники.гхб_ТипыПомещений.Локация);
	Иначе
		_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
		
		_МассивЛокацийДляПарковок = РегистрыСведений.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.ВернутьДоступныеЛокацииДляПарковок();
		_МассивДоступныхЛокаций = РегистрыСведений.гхб_РуководителиЛокаций.ВернутьЛокацииПоРуководителю(_ФЛ);
		
		_Массив = Новый Массив();
		
		Для Каждого Стр Из _МассивДоступныхЛокаций Цикл
			Если НЕ (_МассивЛокацийДляПарковок.Найти(Стр) = Неопределено) Тогда
				_Массив.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если (_Массив.Количество() = 0) Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	ИначеЕсли ЗначениеЗаполнено(Запись.Локация) И _Массив.Найти(Запись.Локация) = Неопределено Тогда 
		ЭтотОбъект.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Локация.СписокВыбора.ЗагрузитьЗначения(_Массив);
		Элементы.Локация.СписокВыбора.СортироватьПоЗначению();
	КонецЕсли;
	
КонецПроцедуры
